# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

In [5]:
import numpy as np
import pandas as pd
import os

## CSV

### CSV Input

In [6]:
df = pd.read_csv('example1.csv')
df
#os.getcwd()

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### CSV Output

In [7]:
df.to_csv('example2.csv',index=False)

## Excel
Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash.

### Excel Input

In [8]:
df=pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

### Excel Output

In [10]:
df.to_excel('Excel_Sample5.xlsx',sheet_name='Sheet5')

## HTML

You may need to install htmllib5,lxml, and BeautifulSoup4. In your terminal/command prompt run:

    conda install lxml
    conda install html5lib
    conda install BeautifulSoup4

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

Pandas can read table tabs off of html. For example:

### HTML Input

Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects:

In [10]:
df = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [15]:
df[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
1,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
2,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539
3,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
4,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
...,...,...,...,...,...,...,...
561,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
562,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
563,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
564,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
565,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

____

_____
_____
# SQL (Optional)

* Note: If you are completely unfamiliar with SQL you can check out my other course: "Complete SQL Bootcamp" to learn SQL.

The pandas.io.sql module provides a collection of query wrappers to both facilitate data retrieval and to reduce dependency on DB-specific API. Database abstraction is provided by SQLAlchemy if installed. In addition you will need a driver library for your database. Examples of such drivers are psycopg2 for PostgreSQL or pymysql for MySQL. For SQLite this is included in Python’s standard library by default. You can find an overview of supported drivers for each SQL dialect in the SQLAlchemy docs.


If SQLAlchemy is not installed, a fallback is only provided for sqlite (and for mysql for backwards compatibility, but this is deprecated and will be removed in a future version). This mode requires a Python database adapter which respect the Python DB-API.

See also some cookbook examples for some advanced strategies.

The key functions are:

* read_sql_table(table_name, con[, schema, ...])	
    * Read SQL database table into a DataFrame.
* read_sql_query(sql, con[, index_col, ...])	
    * Read SQL query into a DataFrame.
* read_sql(sql, con[, index_col, ...])	
    * Read SQL query or database table into a DataFrame.
* DataFrame.to_sql(name, con[, flavor, ...])	
    * Write records stored in a DataFrame to a SQL database.

In [16]:
from sqlalchemy import create_engine

In [17]:
engine = create_engine('sqlite://')

In [19]:
engine = create_engine('sqlite:///college1.db', echo = True)

In [27]:
#df.to_sql('data', engine)
dir(engine)

['__class__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__le__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 '__weakref__',
 '_connection_cls',
 '_contextual_connect',
 '_echo',
 '_execute_clauseelement',
 '_execute_compiled',
 '_execute_default',
 '_execution_options',
 '_has_events',
 '_optional_conn_ctx_manager',
 '_run_visitor',
 '_should_log_debug',
 '_should_log_info',
 '_trans_ctx',
 '_wrap_pool_connect',
 'begin',
 'connect',
 'contextual_connect',
 'create',
 'dialect',
 'dispatch',
 'dispose',
 'driver',
 'drop',
 'echo',
 'engine',
 'execute',
 'execution_options',
 'get_execution_options',
 'has_table',
 'hide_parameters',
 'logger',
 'logging_name',
 'name',
 'pool',
 'raw_connection',
 'run_callable',
 'scalar',
 'schema_for_object',
 'table_names',
 'transaction',
 'update_execution_options',
 'url']

In [20]:
sql_df = pd.read_sql(df,con=engine)

2023-05-25 12:02:40,681 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2023-05-25 12:02:40,696 INFO sqlalchemy.engine.base.Engine ()
2023-05-25 12:02:40,701 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2023-05-25 12:02:40,702 INFO sqlalchemy.engine.base.Engine ()

ObjectNotExecutableError: Not an executable object: [                         Bank NameBank           CityCity StateSt  CertCert  \
0                  First Republic Bank      San Francisco      CA     59017
1                       Signature Bank           New York      NY     57053
2                  Silicon Valley Bank        Santa Clara      CA     24735
3                    Almena State Bank             Almena      KS     15426
4           First City Bank of Florida  Fort Walton Beach      FL     16748
..                                 ...                ...     ...       ...
561                 Superior Bank, FSB           Hinsdale      IL     32646
562                Malta National Bank              Malta      OH      6629
563    First Alliance Bank & Trust Co.         Manchester      NH     34264
564  National State Bank of Metropolis         Metropolis      IL      3815
565                   Bank of Honolulu           Honolulu      HI     21029

                 Acquiring InstitutionAI Closing DateClosing  FundFund
0              JPMorgan Chase Bank, N.A.         May 1, 2023     10543
1                    Flagstar Bank, N.A.      March 12, 2023     10540
2    First–Citizens Bank & Trust Company      March 10, 2023     10539
3                            Equity Bank    October 23, 2020     10538
4              United Fidelity Bank, fsb    October 16, 2020     10537
..                                   ...                 ...       ...
561                Superior Federal, FSB       July 27, 2001      6004
562                    North Valley Bank         May 3, 2001      4648
563  Southern New Hampshire Bank & Trust    February 2, 2001      4647
564              Banterra Bank of Marion   December 14, 2000      4646
565                   Bank of the Orient    October 13, 2000      4645

[566 rows x 7 columns]]

In [43]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15

# Great Job!